In [1]:
from pathlib import Path
import pandas as pd

In [2]:
url_datos = "https://www.openml.org/data/get_csv/16826755/phpMYEkMl"

datos_titanic = pd.read_csv(url_datos)

datos_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1309 non-null   object
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: int64(4), object(10)
memory usage: 143.3+ KB

In [3]:
datos_titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"

* **boat** = el número del bote salvavidas (es decir, sobrevivieron)

* **body** = el número del cuerpo (si encontraron el cuerpo, pero igual murió...)

**DATA LEAKAGE**

In [4]:
datos_titanic.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [5]:
datos_titanic.survived.value_counts()

survived
0    809
1    500
Name: count, dtype: int64

In [6]:
columnas_a_usar = [
    'pclass', 
    'survived', 
    'sex', 
    'age', 
    'sibsp', 
    'parch',
    'fare', 
    'cabin', 
    'embarked',
    'home.dest'
]

In [ ]:
datos_titanic_final = pd.read_csv(url_datos, usecols=columnas_a_usar)

rudatos_titanic_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   sex        1309 non-null   object
 3   age        1309 non-null   object
 4   sibsp      1309 non-null   int64
 5   parch      1309 non-null   int64
 6   fare       1309 non-null   object
 7   cabin      1309 non-null   object
 8   embarked   1309 non-null   object
 9   home.dest  1309 non-null   object
dtypes: int64(4), object(6)
memory usage: 102.4+ KB

In [10]:
ruta_datos_crudos = Path.cwd().resolve().parent / "datos"
ruta_datos_crudos

PosixPath('/Users/david.palacio/Documents/academia/titanic-prediccion/datos')

In [11]:
ruta_archivo = ruta_datos_crudos / "01_datos_crudos_titanic.parquet"

ruta_datos_crudos.mkdir(parents=True, exist_ok=True)

datos_titanic_final.to_parquet(ruta_archivo, index=False)